{
  "recipes": {
    "lwrp_demo::do_source_pull": "Pull source from some repository configured at runtime."
  },
  "groupings": {

  },
  "long_description": "= DESCRIPTION:\n\nThis cookbook uses a chef lightweight resource called 'repo' to define a \ngeneric interface for downloading contents of a source repository.\n\n= REQUIREMENTS:\n\nChef Version >= 0.8.tbd\n\n= ATTRIBUTES: \n\n * destination - where to put the repo locally (ex. \/tmp\/myrepo )\n\n= USAGE:\n\n See \/config\/chef.json for example to use with Chef Solo.\n\n \n\n",
  "recommendations": {

  },
  "dependencies": {
    "resource:repo['default']": [

    ]
  },
  "maintainer": "RightScale, Inc.",
  "suggestions": {

  },
  "description": "Demonstrates the use of the Dependency Injection cookbook design patterns",
  "maintainer_email": "cary@rightscale.com",
  "name": "lwrp_demo",
  "conflicting": {

  },
  "providing": {

  },
  "platforms": {

  },
  "version": "0.0.1",
  "attributes": {
    "lwrp_demo\/destination": {
      "calculated": false,
      "default": "\/tmp\/lwrp_demo",
      "type": "string",
      "choice": [

      ],
      "description": "Path to download repository contents to.",
      "display_name": "Destination",
      "recipes": [

      ],
      "required": "optional"
    }
  },
  "replacing": {

  },
  "license": "Copyright (c) 2010 RightScale, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n'Software'), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and\/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
}